<@override name="title">注册协议</@override>

<@override name="css">
    <link rel="stylesheet" href="${cdn}/css/login.css?v=${ver}">
</@override>

<@override name="content">
    <div id="RZ" >
        <!-- logo  -->
        <div class="logo">
            <div class="w1200">
                <div class="logo_img">
                    <img src="${cdn}/img/logo/logo_000.png" onclick="javascript:location.href='/'"
                         style="cursor: pointer" alt="" class="fl" height="36">
                    <span class="txt">供应商注册</span>
                </div>
            </div>
        </div>
        <!-- 协议 -->
        <div class="mt10">
            <div class="w1200 bg_fff">
                <!-- 三个切换 -->
                <div class="login_three">
                    <ul class="ul_li_fl of">
                        <div class="line"></div>
                        <li class="curr">
                            <div class="num_box">
                                <div class="num">1</div>
                            </div>
                            <div>协议阅读并接受</div>
                        </li>
                        <li>
                            <div class="num_box">
                                <div class="num">2</div>
                            </div>
                            <div>注册信息填写</div>
                        </li>
                        <li>
                            <div class="num_box">
                                <div class="num"><i class="iconfont icon-duihao f26 disib mt_5"></i></div>
                            </div>
                            <div>注册完成</div>
                        </li>

                    </ul>
                </div>
                <div class="tc f16 mb20 fb">
                    质量协议
                </div>
                <div class="ml20 mr10 bg_f9f9f9">
                    <div class="p10 agreement—contont">
                        <div>
                            供需双方根据《中华人民共和国合同法》、《产品质量法》及有关规定，双方本着“质量
                            第一、互惠互利，共同发展”的原则，为确保产品质量的稳定和不断提高，经协商一致签
                            订本协议，并共同遵守。
                        </div>
                        <div class="title">
                            一、质量管理
                        </div>
                        <div>
                            1、供方应建立完善的质量管理制度，包括原材料进厂验收和管理制度，工序检验和控制
                            管理制度，出厂检验和试验管理制度，质量岗位责任制度，质量奖惩制度等等,以确保提
                            供给需方稳定、合格的产品。
                            <br>
                            2、供方应不断改进其品质，愿意配合需方不断提高各自的品质管理体系，达到品质目标。
                            <br>
                            供方参照ISO9001管理体系进行质量管理，关键原辅材料、备件供方必须通过ISOI9001：
                            2008质量体系认证（废钢供方除外），鼓励具备条件的供方实施TS16949质量体系认证。
                            <br>
                            3、供方应严格按照经需方认可的，体现于相应的国家标准、行业标准、需方标准、图纸、
                            技术协议等当中的质量和技术规格要求生产或供应货品。如有任何变动，供需方应负责书
                            面告知对方，对方需第一时间进行确认并严格跟进相关变化。
                            <br>
                            4、供方发生如下变更时：重要原材料变更、加工方式及工艺变更等等，供方必须进行相
                            关检测、实验证明产品满足需方技术及质量要求后，再通知需方并向需方提供样品及相关
                            验证报告，经需方同意后才能正式供货。
                            <br>
                            5、需方提出的任何质量投诉，供方应立即采购更正行动予以改进并在24小时内反馈给需方。
                            <br>
                            6、供方应主动、积极地参与需方发起的质量改进活动，以利于共同进步。
                            <br>
                            7、若出现质量问题需方向供方发出《整改通知书》，供方应在接到通知书三个工作日内
                            按《整改通知书》上的要求签署意见后签字、盖章返回需方，并认真实施改进措施，使问
                            题得以解决。
                            <br>
                            8、为保证供方产品质量的稳定性，确保供方严格按照需方的要求和国家相关的法律法规
                            进行质量控制，需方根据自身需要或在供方产品发生重大异常时对供方进行质量审核。
                        </div>
                        <div class="title">
                            二、质量验收
                        </div>
                        <div>
                            1、供方交货时必须提供（废钢除外）：质量保证书（标明执行标准，生产日期、理化指标
                            等），否则需方有权拒收，因此带来的相关损失由供方承担。
                            <br>
                            2、货到指定地点后，需方根据需要组织入厂验收，确认产品质量。验收标准包括国家标准
                            、行业标准、需方标准、图纸、技术协议等，发现不合格项目即为不合格。
                            <br>
                            3、需方对供方产品不合格的统计范围，包括需方入厂检验、生产过程、用户使用中发现的
                            不合格品。
                        </div>
                        <div class="title">
                            三、不良品处理方式
                        </div>
                        <div>
                            1、需方在检验过程、生产使用、用户使用中发现供方提供的物料出现质量问题，需方及时
                            以书面形式通知供方确认。供方如有异议，应在24小时内书面答复；否则，即视为供方同意
                            需方的判定。
                            <br>
                            2、建议供方授权专人处理不良品事宜，提高处理效率。
                            <br>
                            3、供方应对在需方发生不良品进行调查、分析、改进、追踪及保存相应记录。
                            <br>
                            4、对于属于供方责任的不合格品，供方在接到需方通知后，应在规定时间内到需方的所在
                            地共同确认后做出处理。
                            <br>
                            5、供方应自行派人负责不合格品的退货，需方有义务根据实际需要在需方厂房范围内免费
                            向供方提供叉车等装卸工具。
                        </div>
                        <div class="title">
                            四、生产过程管理
                        </div>
                        <div>
                            供方应建立和完善生产过程管理和控制，以确保提供给需方稳定、合格的产品，这些制度至
                            少应确保：
                            <br>
                            1、生产设备、工艺装备、检测手段的种类、数量、准确度和设备精度等能满足生产和工艺的
                            要求。定期对设备进行点检，并保存相关记录。
                            <br>
                            2、具有与生产加工、检验和试验、包装、储存等相适应的工作环境条件。
                            <br>
                            3、生产中使用的计量器具、试验设备都必须具备有效的检定/校准合格证书。
                            <br>
                            4、供方必须根据工艺要求，对于重要工序和关键工序制定及完善的《作业指导书》。
                        </div>
                        <div class="title">
                            五、质量责任约定
                        </div>
                        <div>
                            质量责任约定的原则：供方应确保供货的产品符合需方规定的采购要求，不管需方是否进行
                            入厂检验，都不能免除供方提供合格产品的质量责任。需方根据相关法律法规和实际需要，
                            确定实施检验和其他必要的活动，以确保采购的产品满足规定的采购要求。其他说明事项如
                            下：
                            <br>
                            1、供方提供的产品如在需方入厂验收时被判为不合格，需方有权拒收。因生产急需，需方同
                            意让步接受的，双方协商降价处理。
                            <br>
                            2、供方所供产品在需方生产过程中被判质量不合格时，需方根据损失向供方索赔。
                            <br>
                            3、因供方提供的物料出现混装、标识不符、包装外观破损等有质量隐患的不合格，需方有权
                            拒收并退回供方。
                            <br>
                            4、为防止退回供方的不合格品混入合格品中再次送货，如需方发现供方把退回不合格品（或
                            其它同类不合格品）混入合格品中再次送货或整批不合格品再次送货时，造成的全部损失由供
                            方承担，供方并向需方支付该批物料（再次送货批）价值两倍的违约金，需方并有权暂停供方
                            供货关系。
                        </div>
                        <div class="title">
                            六、考核评价
                        </div>
                        <div>
                            为促进供方的产品质量的稳定和提高，需方按照《供应商管理程序》，根据供方质量情况进行
                            考核：每年由供方主管部门牵头组织采购部门、技术质量部、生产厂等部门组成供应商评审组
                            进行一次复评，评价按评价要素由相关部门进行打分，评定结果分A、B、C、D四个等级。
                            <br>
                            1、90分～100分为优秀供方即A级供应商。作为建立战略合作伙伴的后备。 <br>
                            2、80分～90分(不含90分)为良好供方即B级供应商。 <br>
                            3、70分～80分(不含80分)为合格供方即C级供应商。 <br>
                            4、70分以下为不合格供方即D级供应商，将取消其合格供应商资格。 <br>
                            未通过ISO9001质量体系认证的供应商（废钢除外）评审结果不能评A，评价等级递减。
                            评价结果作为采购活动中选择供方的重要依据之一。
                        </div>
                        <div class="title">
                            七、争议的处理
                        </div>
                        <div>
                            1、如供方对需方的质量判定有异议，请务必在24小时内书面向需方提出，双方协商解决。 <br>
                            2、若协商不成，由供方向双方认可的第三方质量检测机构申请仲裁，按照仲裁结果执行。 <br>
                            3、仍不能解决的，提请需方所在地人民法院裁决。
                        </div>
                        <div class="title">
                            八、其他
                        </div>
                        <div>
                            1、供方供货过程中，应服从需方的管理要求，若有损坏需方财物时，需方有权要求供方承
                            担损失。<br>
                            2、供方和需方来往函件、传真等均按双方购销合同约定的地址、传真号码传送。<br>
                            3、供方承诺所提交的资质材料真实有效、所供产品保质保量，如有弄虚作假、串通投标、
                            以次充好等恶劣行径的，一经发现，将永久列入黑名单，并依法追究其法律责任。<br>
                            4：供方历任法人、股东、董事、监事及高管中有曾经担任我公司三级及以上主管，或在我公司从
                            事过采购/招标/质检/设备/工程/生产等类似重要岗位人员的，不得申请合格供应商/一次性供应
                            商/新增供货范围，如经核实弄虚作假的，我公司将从严、从重处理。<br>
                            5：供方除法人、股东、董事、监事及高管外，其他任职员工中有曾经担任我公司三级及以上主管，
                            或在我公司从事过采购/招标/质检/设备/工程/生产等类似重要岗位人员的，如申请合格供应商/
                            一次性供应商/新增供货范围，需按要求如实备案。如经核实弄虚作假的，我公司将从严、从重处
                            理。
                        </div>
                    </div>
                </div>
                <div class="mt50 ml30">
                    <div class="mb15">
                        在您接受以下协议之前，请仔细阅读协议的全部内容。接受本协议，代表您完全接受以下协议条款和条件。如您不接受以下协议中的条款，请勿进行后续操作
                    </div>
                    <div class="mb15">
                        <el-checkbox v-model="checked">我已经阅读并同意以下协议：</el-checkbox>
                    </div>
                    <div class="mb50 c_blue">
                        <a class="c_blue" @click="showDialog(1)">反商业贿赂协议</a>、
                        <a class="c_blue" @click="showDialog(2)">知识产权保护协议</a>、
                        <a class="c_blue" @click="showDialog(3)">保密承诺函</a>
                    </div>
                    <div class="tc pb50">
                        <button class="main_btn w140 lh42 h42" @click="agreement();">同意并继续</button>
                    </div>
                </div>

                <#--反商业贿赂协议-->
                <div>
                    <el-dialog
                            title="反商业贿赂协议"
                            :visible.sync="centerDialogVisible1"
                            :close-on-click-modal="false"
                            width="800px"
                            >
                        <div class="ml20 mr10 bg_f9f9f9">
                            <div class="p10 agreement—contont" style="">
                                <div>
                                    &nbsp;&nbsp;&nbsp;&nbsp;为了规范双方招投标、采购、销售、维检、基建工程和服务等各项商务合作，预防和制止商业贿赂和不正当竞争行为，保护双方的合法权益，体现诚信合作、公平竞争的原则，经甲乙双方同意，特制定本协议，甲乙双方要严格遵守，互相监督，创建洁净良好的业务环境。
                                    <br>
                                </div>
                                <div class="title">
                                    一、甲方权责
                                </div>
                                <div>
                                    （一）甲方人员有责任向乙方介绍本公司反腐纠风规定及规章制度。
                                    <br>
                                    （二）甲方的公司纪检监察及审计人员有权对双方的合同执行过程与遵守情况进行跟踪监督审查。
                                    <br>
                                    （三）甲方人员在业务往来及合同执行过程中，应遵守以下规定：
                                    <br>
                                    1、不得以任何形式向乙方索要贿赂，吃拿卡要及好处费等；
                                    <br>
                                    2、不得接受乙方馈赠的各种购物卡、会员卡、有价证券、贵重物品、商业保险等贿赂；
                                    <br>
                                    3、不得让乙方报销任何费用；不得参加乙方提供的超出一般公务接待标准的高消费娱乐、宴请活动；
                                    <br>
                                    4、不得向乙方介绍家属子女或亲友等从事与甲方发生合同项目有关的材料、设备供应、工程分包等活动；
                                    <br>
                                    5、不得要求乙方为家属子女或亲友等安排工作、出境和国内旅游等；
                                    <br>
                                    6、不得借婚丧嫁娶等各种理由收受乙方的钱、有价证券、财物等。
                                    <br>
                                    （四）对乙方主动给与的金钱、有价证券、财物等，甲方的工作人员要坚决谢绝，无法拒绝的要按照甲方公司《礼品处理规定》执行。
                                    <br>
                                    （五）甲方人员在执行合同过程中，必须遵守甲方公司反腐纠风的有关规定。
                                    <br>

                                </div>
                                <div class="title">
                                    二、乙方权责
                                </div>
                                <div>
                                    （一）乙方的纪检监察人员有权对双方在采购供应及合同执行过程与遵守情况进行监督，并能够积极配合甲方纪检监察审计工作人员就有关违法违纪问题进行调查取证。
                                    <br>
                                    （二）乙方有义务了解甲方在反腐纠风方面的各项制度和规定，并主动配合甲方遵守执行。
                                    <br>
                                    （三）乙方人员不得以任何方式向甲方的工作人员了解甲方的商业秘密。
                                    <br>
                                    （四）乙方人员在与甲方合作过程中，应遵守以下规定：
                                    <br>
                                    1、不得向甲方人员行贿，提供回扣或其他任何形式的好处费等；
                                    <br>
                                    2、不得向甲方人员馈赠各种购物卡、有价证券、贵重物品、商业保险等贿赂；
                                    <br>
                                    3、不得给甲方人员报销任何费用；
                                    <br>
                                    4、不得为甲方人员购置或无偿提供交通工具、通讯工具、家电、办公用品等；
                                    <br>
                                    5、不得邀请甲方人员参加超出一般公务接待标准的高消费娱乐、宴请活动；
                                    <br>
                                    6、不得接受甲方人员介绍家属子女或亲友等从事与该合同项目有关的材料、设备供应或该项目分包等经济活动；
                                    <br>
                                    7、不得为甲方人员的家属子女或亲友等安排工作、出境和国内旅游等；
                                    <br>
                                    8、不得借婚丧嫁娶、乔迁喜庆等各种理由向甲方的工作人员赠送钱、物、有价证券等。
                                    <br>
                                    （五）乙方有责任对本单位工作人员进行廉洁廉政教育。
                                    <br>
                                    （六）乙方发现甲方人员有吃、拿、卡、要、报等不廉洁行为的，应及时告知甲方纪检监察部门，如不及时告知，一经发现，严格按照本协议处理，并视同乙方主动向甲方进行商业贿赂。
                                    <br>
                                    （七）乙方如出现以次充好、弄虚作假等不法行为，甲方人员有责任向甲方的纪检监察部门告知，一经查实，甲方的纪检监察部门有权按照相关规定对乙方进行处罚。
                                    <br>
                                </div>
                                <div class="title">
                                    三、甲乙双方人员界定
                                </div>
                                <div>
                                    （一）甲方人员：包括与乙方经济利益有关的甲方正式员工、下属关联公司员工、临时雇用员工、为甲方工作的劳务公司员工。
                                    <br>
                                    （二）乙方人员：包括与甲方经济利益有关的乙方正式员工、下属关联公司员工、临时雇用员工、为乙方工作的劳务公司员工。
                                    <br>
                                </div>
                                <div class="title">
                                    四、违约责任
                                </div>
                                <div>
                                    （一）甲方违反本协议第一条第（三）（四）（五）项约定，经调查属实，甲方将对当事人进行严肃处理，对涉嫌犯罪人员移送司法机关处理。对乙方造成损失的，按合同约定予以赔偿。
                                    <br>
                                    （二）乙方违反本协议第二条第（三）（四）（六）项约定，经甲方调查属实的，乙方同意以下处理方案：
                                    <br>
                                    1、甲方有权解除双方签订尚未执行完毕的合同（或协议），由此造成的经济损失由乙方承担。
                                    <br>
                                    2、甲方有权按照如下方式从应付款项（含押金、保证金、预付款、合同款等）中一次性扣除违约金：（1）乙方人员向甲方人员进行商业贿赂的金额在人民币1万元（含1万元）以下的，扣除额为其3倍；（2）1万元以上5万元（含5万元）以下的，扣除额为其5倍；（3）5万元以上10万元（含10万元）以下的，扣除额为其10倍；（4）10万元以上的，扣除额为其8倍。
                                    <br>
                                    3、因乙方人员严重违反本协议有关规定的，甲方有权终止履行合同，并将乙方列入黑名单，禁止进入甲方业务市场，乙方自愿放弃所有甲方所欠乙方的应付款，包括采购未结货款、销售预付款、各种保证金等，若给甲方造成经济损失，甲方有权向乙方追索。
                                    <br>
                                </div>
                                <div class="title">
                                    五、本协议的生效与纠纷解决
                                </div>
                                <div>
                                    （一）因本协议发生的所有争议，双方均应向甲方所在地有管辖权的法院提起诉讼。
                                    <br>
                                    （二）本协议适用于与日照钢铁控股集团有限公司所有关联公司发生的业务往来。
                                    <br>
                                    （三）本协议为双方真实有效的意愿表达，任何一方不得以任何理由对本协议主张撤销、变更或确认无效。
                                    <br>
                                    （四）无论甲乙双方合作或有经济往来期间（包括不限于双方业务终止但有应收应付款的情况）本协议持续有效，并作为本协议签订前和本协议签订后双方所签订的所有合同或协议（统称主合同）的附件，与主合同具备同等法律效力。
                                    <br>
                                    （五）甲方监督电话：0633-6181234
                                    <br>
                                    甲方监督举报邮箱：jwjcsws@rizhaosteel.com
                                    <br>
                                </div>
                            </div>
                        </div>

                        <span slot="footer" class="dialog-footer">
                        <#--<el-button type="primary" @click="addLine(1,1)">确 定</el-button>-->
                        <el-button type="primary" @click="centerDialogVisible1 = false">关 闭</el-button>
                    </span>
                    </el-dialog>
                </div>

                <#--知识产权保护协议-->
                <div>
                    <el-dialog
                            title="知识产权保护协议"
                            :visible.sync="centerDialogVisible2"
                            :close-on-click-modal="false"
                            width="800px"
                            >
                        <div class="ml20 mr10 bg_f9f9f9">
                            <div class="p10 agreement—contont">
                                <div>
                                    &nbsp;&nbsp;&nbsp;&nbsp;甲方与乙方就签订的所有采购合同，达成如下协议，作为签订的所有采购合同的补充条款：
                                    <br>
                                </div>
                                <div class="title">
                                    一、知识产权条款
                                </div>
                                <div>
                                    1、乙方应保证甲方在使用本采购合同项下的货物或其任何一部分时免受第三方侵犯其知识产权、商标权或工业设计权的起诉。
                                    <br>
                                    2、甲方不对乙方提供的货物的商标、专利是否侵犯他人的权利负责，如因乙方提供货物引发争议或违法导致买方受损的，乙方应赔偿。
                                    <br>
                                    3、乙方应保证提供货物的商标、专利等知识产权归乙方所有的，对于非乙方所有知识产权的货物，乙方有义务提供甲方正规渠道证明。
                                    <br>
                                    4、乙方商标、专利许可甲方的使用范围仅限于合同范围内产品，合同终止后，乙方应授权甲方或第三方从事制造所必须的知识产权、技术协助，技术文件设备或工具。
                                    <br>
                                    5、如乙方违背前述条款约定的事宜，甲方有权解除前述签订的采购合同，因此给甲方造成的损失（包括但不限于第三方索赔、行政处罚等），乙方应据实赔偿。
                                    <br>
                                </div>
                                <div class="title">
                                    二、其他
                                </div>
                                <div>
                                    1、本协议作为双方签订所有采购合同的补充，与前述合同具有同等法律效力；本协议与前述合同约定不一致的，以本协议约定为准。
                                    <br>
                                </div>
                            </div>
                        </div>

                        <span slot="footer" class="dialog-footer">
                        <#--<el-button type="primary" @click="addLine(1,1)">确 定</el-button>-->
                        <el-button type="primary" @click="centerDialogVisible2 = false">关 闭</el-button>
                    </span>
                    </el-dialog>
                </div>



                <#--保密承诺函-->
                <div>
                    <el-dialog
                            title="保密承诺函"
                            :visible.sync="centerDialogVisible3"
                            :close-on-click-modal="false"
                            width="800px"
                            >
                        <div class="ml20 mr10 bg_f9f9f9">
                            <div class="p10 agreement—contont">
                                <div>
                                    &nbsp;&nbsp;&nbsp;&nbsp;为保护甲方商业秘密及技术秘密，经甲乙双方协商达成如下协议，作为双方开展业务合作的补充条款：
                                    <br>
                                </div>
                                <div class="title">
                                    一、保密承诺条款
                                </div>
                                <div>
                                    （一）不向第三方透露在合作期间获得和知晓的对方公司（包括其分支机构、控股公司和合资公司）的商业秘密及属于第三方但对方负有保密义务的信息。商业秘密包括技术秘密和经营秘密，其中技术秘密包括但不限于工作进度、技术方案、工程设计、电路设计、制造方法、配方、工艺流程、技术指标、计算机软件、数据库、研究开发记录、技术报告、测试报告、检测报告、实验数据、试验结果、图纸、样品、样机、模型、模具、操作手册、技术文档、相关的函电等。经营秘密包括但不限于双方洽谈的情况、签署的任何文件，包括合同、协议、备忘录、订单等文件中所包含的一切信息、客户名单、行销计划、采购资料、定价政策、财务资料、进货渠道、法律事务信息、人力资源信息等。
                                    <br>
                                    （二）未经甲方书面同意，不在双方合作目的之外使用或向第三方透露对方的任何商业秘密，不论该商业秘密是以口头、书面、磁盘、胶片或电子件等任何形式存在的。
                                    <br>
                                    （三）当甲方提出收回包含对方商业秘密的有关资料时，我方将有关资料及其复制件交还给甲方，或应甲方要求将这些资料及其复制件销毁。
                                    <br>
                                    （四）在甲方公司内活动时，应听从接待人员的安排和引导。未经对方允许不得进入对方实验室、办公室等工作环境，不与甲方开发人员进行私下交流。
                                    <br>
                                    （五）如果供应商违反上述条款，日照钢铁控股集团有限公司有权根据违反的程度以及造成的损害采取以下措施：
                                    <br>
                                    1、重新评估供应商的地位；
                                    <br>
                                    2、终止双方的合作；
                                    <br>
                                    3、要求赔偿损失。
                                    <br>
                                    在采取上述措施前，日照钢铁控股集团有限公司将给予供应商合理的在先通知。
                                    <br>
                                </div>
                                <div class="title">
                                    二、其他
                                </div>
                                <div>
                                    （一）本协议作为双方签订所有合同的补充，与前述合同具有同等法律效力；本协议与前述合同约定不一致的，以本协议约定为准。
                                    <br>
                                </div>
                            </div>
                        </div>

                        <span slot="footer" class="dialog-footer">
                        <#--<el-button type="primary" @click="addLine(1,1)">确 定</el-button>-->
                        <el-button type="primary" @click="centerDialogVisible3 = false">关 闭</el-button>
                    </span>
                    </el-dialog>
                </div>


            </div>
        </div>
    </div>
</@override>

<@override name="js">
    <script type="text/babel" src="${cdn}/js/provider/register.js?v=${ver!}"></script>
</@override>

<@extends name="/base-rgpur.ftl"/>